// пример арены, удалить, как откроется сервер
export const arenaExample = {
  "ants": [
    {
      "q": 1,
      "r": 1,
      "type": 1,
      "health": 180,
      "id": "2afdf954-ea89-4391-bab9-bc8104c1bfd8",
      "food": {
        "type": 0,
        "amount": 0
      }
    },
    {
      "q": 119,
      "r": 172,
      "type": 2,
      "health": 80,
      "id": "d37deda2-d211-48fc-966f-cab66931e472",
      "food": {
        "type": 0,
        "amount": 0
      }
    },
    {
      "q": 119,
      "r": 172,
      "type": 0,
      "health": 130,
      "id": "de8d8d4c-431b-4e0a-8a43-fb79abd08108",
      "food": {
        "type": 0,
        "amount": 0
      }
    }
  ],
  "enemies": [],
  "map": [
    {
      "q": 117,
      "r": 168,
      "cost": 1,
      "type": 2
    },
    {
      "q": 118,
      "r": 169,
      "cost": 1,
      "type": 2
    },
    {
      "q": 116,
      "r": 171,
      "cost": 1,
      "type": 2
    },
    {
      "q": 119,
      "r": 170,
      "cost": 1,
      "type": 2
    },
    {
      "q": 120,
      "r": 174,
      "cost": 1,
      "type": 2
    },
    {
      "q": 121,
      "r": 171,
      "cost": 1,
      "type": 2
    },
    {
      "q": 118,
      "r": 170,
      "cost": 1,
      "type": 2
    },
    {
      "q": 119,
      "r": 169,
      "cost": 1,
      "type": 2
    },
    {
      "q": 122,
      "r": 170,
      "cost": 1,
      "type": 2
    },
    {
      "q": 119,
      "r": 172,
      "cost": 1,
      "type": 1
    },
    {
      "q": 115,
      "r": 172,
      "cost": 1,
      "type": 2
    },
    {
      "q": 122,
      "r": 172,
      "cost": 1,
      "type": 2
    },
    {
      "q": 115,
      "r": 173,
      "cost": 2,
      "type": 3
    },
    {
      "q": 117,
      "r": 173,
      "cost": 1,
      "type": 2
    },
    {
      "q": 122,
      "r": 174,
      "cost": 1,
      "type": 2
    },
    {
      "q": 119,
      "r": 171,
      "cost": 1,
      "type": 1
    },
    {
      "q": 121,
      "r": 170,
      "cost": 1,
      "type": 2
    },
    {
      "q": 121,
      "r": 173,
      "cost": 1,
      "type": 2
    },
    {
      "q": 116,
      "r": 175,
      "cost": 1,
      "type": 2
    },
    {
      "q": 122,
      "r": 171,
      "cost": 1,
      "type": 2
    },
    {
      "q": 115,
      "r": 171,
      "cost": 1,
      "type": 4
    },
    {
      "q": 121,
      "r": 175,
      "cost": 1,
      "type": 2
    },
    {
      "q": 116,
      "r": 170,
      "cost": 1,
      "type": 4
    },
    {
      "q": 117,
      "r": 172,
      "cost": 1,
      "type": 2
    },
    {
      "q": 117,
      "r": 175,
      "cost": 1,
      "type": 2
    },
    {
      "q": 120,
      "r": 170,
      "cost": 1,
      "type": 2
    },
    {
      "q": 121,
      "r": 168,
      "cost": 2,
      "type": 3
    },
    {
      "q": 120,
      "r": 176,
      "cost": 1,
      "type": 2
    },
    {
      "q": 121,
      "r": 176,
      "cost": 30,
      "type": 5
    },
    {
      "q": 118,
      "r": 174,
      "cost": 1,
      "type": 2
    },
    {
      "q": 118,
      "r": 173,
      "cost": 1,
      "type": 2
    },
    {
      "q": 118,
      "r": 171,
      "cost": 1,
      "type": 1
    },
    {
      "q": 117,
      "r": 170,
      "cost": 1,
      "type": 2
    },
    {
      "q": 120,
      "r": 175,
      "cost": 1,
      "type": 2
    },
    {
      "q": 121,
      "r": 169,
      "cost": 2,
      "type": 3
    },
    {
      "q": 120,
      "r": 168,
      "cost": 1,
      "type": 2
    },
    {
      "q": 118,
      "r": 168,
      "cost": 1,
      "type": 2
    },
    {
      "q": 120,
      "r": 173,
      "cost": 1,
      "type": 2
    },
    {
      "q": 117,
      "r": 169,
      "cost": 1,
      "type": 2
    },
    {
      "q": 117,
      "r": 174,
      "cost": 1,
      "type": 2
    },
    {
      "q": 117,
      "r": 171,
      "cost": 1,
      "type": 2
    },
    {
      "q": 116,
      "r": 173,
      "cost": 1,
      "type": 2
    },
    {
      "q": 118,
      "r": 172,
      "cost": 1,
      "type": 2
    },
    {
      "q": 121,
      "r": 172,
      "cost": 1,
      "type": 2
    },
    {
      "q": 119,
      "r": 168,
      "cost": 1,
      "type": 2
    },
    {
      "q": 120,
      "r": 171,
      "cost": 1,
      "type": 2
    },
    {
      "q": 119,
      "r": 174,
      "cost": 1,
      "type": 2
    },
    {
      "q": 122,
      "r": 173,
      "cost": 1,
      "type": 2
    },
    {
      "q": 120,
      "r": 169,
      "cost": 1,
      "type": 2
    },
    {
      "q": 119,
      "r": 173,
      "cost": 1,
      "type": 2
    },
    {
      "q": 117,
      "r": 176,
      "cost": 1,
      "type": 2
    },
    {
      "q": 119,
      "r": 176,
      "cost": 1,
      "type": 2
    },
    {
      "q": 120,
      "r": 172,
      "cost": 1,
      "type": 2
    },
    {
      "q": 118,
      "r": 175,
      "cost": 1,
      "type": 2
    },
    {
      "q": 116,
      "r": 174,
      "cost": 1,
      "type": 2
    },
    {
      "q": 121,
      "r": 174,
      "cost": 1,
      "type": 2
    },
    {
      "q": 119,
      "r": 175,
      "cost": 1,
      "type": 2
    },
    {
      "q": 118,
      "r": 176,
      "cost": 1,
      "type": 4
    },
    {
      "q": 116,
      "r": 169,
      "cost": 1,
      "type": 2
    },
    {
      "q": 123,
      "r": 172,
      "cost": 2,
      "type": 3
    },
    {
      "q": 116,
      "r": 172,
      "cost": 1,
      "type": 2
    }
  ],
  "food": [
    {
      "q": 121,
      "r": 175,
      "type": 2,
      "amount": 5
    },
    {
      "q": 117,
      "r": 175,
      "type": 1,
      "amount": 3
    },
    {
      "q": 120,
      "r": 172,
      "type": 2,
      "amount": 9
    }
  ],
  "turnNo": 56,
  "nextTurnIn": 1.436,
  "home": [
    {
      "q": 118,
      "r": 171
    },
    {
      "q": 119,
      "r": 172
    },
    {
      "q": 119,
      "r": 171
    }
  ],
  "score": 0,
  "spot": {
    "q": 119,
    "r": 172
  }
}