// пример арены, удалить, как откроется сервер
export const arenaExample = {
    "ants": [
        {
            "q": -71,
            "r": -62,
            "type": 1,
            "health": 180,
            "id": "91d50fba-0ae8-4ffd-9a5f-ae042abd8ffa",
            "lastMove": [
                {
                    "q": -71,
                    "r": -60
                },
                {
                    "q": -72,
                    "r": -60
                },
                {
                    "q": -72,
                    "r": -61
                },
                {
                    "q": -71,
                    "r": -62
                }
            ],
            "move": [
                {
                    "q": -71,
                    "r": -63
                },
                {
                    "q": -70,
                    "r": -64
                }
            ],
            "food": {
                "type": 0,
                "amount": 0
            }
        },
        {
            "q": -70,
            "r": -60,
            "type": 2,
            "health": 80,
            "id": "daa894be-c8ec-40c2-a5c0-b5e8e46c8b3b",
            "food": {
                "type": 0,
                "amount": 0
            }
        },
        {
            "q": -70,
            "r": -59,
            "type": 0,
            "health": 130,
            "id": "e3934ce1-aabe-4042-aedf-e5e4ecf56afc",
            "move": [
                {
                    "q": -70,
                    "r": -60
                }
            ],
            "food": {
                "type": 2,
                "amount": 8
            }
        },
        {
            "q": -70,
            "r": -61,
            "type": 0,
            "health": 130,
            "id": "2e46dc8a-471b-4c81-b97f-3cbc4611e8b6",
            "move": [
                {
                    "q": -71,
                    "r": -61
                }
            ],
            "food": {
                "type": 0,
                "amount": 0
            }
        },
        {
            "q": -72,
            "r": -64,
            "type": 1,
            "health": 135,
            "id": "5014cf77-b955-4341-93c8-fb4560ecfd76",
            "lastMove": [
                {
                    "q": -73,
                    "r": -63
                },
                {
                    "q": -72,
                    "r": -64
                }
            ],
            "food": {
                "type": 0,
                "amount": 0
            }
        },
        {
            "q": -68,
            "r": -55,
            "type": 2,
            "health": 80,
            "id": "cd348beb-4bff-4889-b353-b16de4114939",
            "food": {
                "type": 0,
                "amount": 0
            }
        },
        {
            "q": -72,
            "r": -62,
            "type": 1,
            "health": 60,
            "id": "4d56c30d-bd29-409f-a5c0-50490d996c84",
            "food": {
                "type": 0,
                "amount": 0
            }
        },
        {
            "q": -71,
            "r": -61,
            "type": 0,
            "health": 130,
            "id": "b59f5239-2fde-45d4-a27f-51f527fb6d0e",
            "food": {
                "type": 0,
                "amount": 0
            }
        },
        {
            "q": -70,
            "r": -60,
            "type": 0,
            "health": 130,
            "id": "49f74277-5099-42ee-8621-5973822d721d",
            "move": [
                {
                    "q": -70,
                    "r": -59
                },
                {
                    "q": -70,
                    "r": -58
                },
                {
                    "q": -70,
                    "r": -57
                },
                {
                    "q": -69,
                    "r": -57
                },
                {
                    "q": -68,
                    "r": -57
                }
            ],
            "food": {
                "type": 0,
                "amount": 0
            }
        },
        {
            "q": -74,
            "r": -59,
            "type": 0,
            "health": 130,
            "id": "6f76ae01-2f59-4713-af8a-edcc19f8d815",
            "food": {
                "type": 1,
                "amount": 8
            }
        },
        {
            "q": -71,
            "r": -61,
            "type": 2,
            "health": 80,
            "id": "e9075722-d76b-4f7a-b3f1-9d5deed149b9",
            "food": {
                "type": 0,
                "amount": 0
            }
        },
        {
            "q": -69,
            "r": -56,
            "type": 0,
            "health": 130,
            "id": "46be85d1-5460-421e-932c-55112a34fec8",
            "food": {
                "type": 0,
                "amount": 0
            }
        }
    ],
    "enemies": [
        {
            "q": -70,
            "r": -65,
            "type": 1,
            "attack": 70,
            "health": 180,
            "food": {
                "type": 1,
                "amount": 2
            },
            "id": "f680722b-4405-f7b8-c07e-07a70d67a0de"
        },
        {
            "q": -75,
            "r": -61,
            "type": 0,
            "attack": 30,
            "health": 130,
            "food": {
                "type": 2,
                "amount": 1
            },
            "id": "39e30f70-6856-3a5e-3f1f-be06acc36a64"
        },
        {
            "q": -71,
            "r": -64,
            "type": 1,
            "attack": 70,
            "health": 180,
            "food": {
                "type": 1,
                "amount": 2
            },
            "id": "46034e95-8112-9b71-2c41-bdfbdece4871"
        }
    ],
    "map": [
        {
            "q": -70,
            "r": -63,
            "cost": 1,
            "type": 3
        },
        {
            "q": -71,
            "r": -53,
            "cost": 1,
            "type": 4
        },
        {
            "q": -70,
            "r": -52,
            "cost": 1,
            "type": 4
        },
        {
            "q": -68,
            "r": -54,
            "cost": 1,
            "type": 4
        },
        {
            "q": -68,
            "r": -55,
            "cost": 1,
            "type": 2
        },
        {
            "q": -72,
            "r": -59,
            "cost": 1,
            "type": 2
        },
        {
            "q": -72,
            "r": -60,
            "cost": 1,
            "type": 2
        },
        {
            "q": -65,
            "r": -52,
            "cost": 1,
            "type": 3
        },
        {
            "q": -67,
            "r": -54,
            "cost": 1,
            "type": 4
        },
        {
            "q": -67,
            "r": -61,
            "cost": 1,
            "type": 2
        },
        {
            "q": -68,
            "r": -52,
            "cost": 1,
            "type": 4
        },
        {
            "q": -65,
            "r": -57,
            "cost": 1,
            "type": 2
        },
        {
            "q": -68,
            "r": -51,
            "cost": 1,
            "type": 2
        },
        {
            "q": -66,
            "r": -58,
            "cost": 1,
            "type": 2
        },
        {
            "q": -73,
            "r": -65,
            "cost": 1,
            "type": 2
        },
        {
            "q": -74,
            "r": -58,
            "cost": 1,
            "type": 2
        },
        {
            "q": -72,
            "r": -63,
            "cost": 1,
            "type": 2
        },
        {
            "q": -70,
            "r": -57,
            "cost": 1,
            "type": 2
        },
        {
            "q": -67,
            "r": -60,
            "cost": 1,
            "type": 2
        },
        {
            "q": -69,
            "r": -61,
            "cost": 1,
            "type": 2
        },
        {
            "q": -68,
            "r": -64,
            "cost": 1,
            "type": 3
        },
        {
            "q": -69,
            "r": -57,
            "cost": 1,
            "type": 2
        },
        {
            "q": -70,
            "r": -55,
            "cost": 1,
            "type": 2
        },
        {
            "q": -71,
            "r": -59,
            "cost": 1,
            "type": 2
        },
        {
            "q": -65,
            "r": -56,
            "cost": 1,
            "type": 2
        },
        {
            "q": -65,
            "r": -53,
            "cost": 1,
            "type": 3
        },
        {
            "q": -73,
            "r": -63,
            "cost": 1,
            "type": 2
        },
        {
            "q": -73,
            "r": -62,
            "cost": 1,
            "type": 2
        },
        {
            "q": -70,
            "r": -64,
            "cost": 1,
            "type": 2
        },
        {
            "q": -68,
            "r": -53,
            "cost": 1,
            "type": 4
        },
        {
            "q": -64,
            "r": -56,
            "cost": 1,
            "type": 3
        },
        {
            "q": -69,
            "r": -65,
            "cost": 1,
            "type": 2
        },
        {
            "q": -68,
            "r": -56,
            "cost": 1,
            "type": 2
        },
        {
            "q": -73,
            "r": -64,
            "cost": 1,
            "type": 2
        },
        {
            "q": -74,
            "r": -63,
            "cost": 1,
            "type": 2
        },
        {
            "q": -71,
            "r": -54,
            "cost": 1,
            "type": 2
        },
        {
            "q": -65,
            "r": -58,
            "cost": 1,
            "type": 2
        },
        {
            "q": -69,
            "r": -51,
            "cost": 1,
            "type": 2
        },
        {
            "q": -69,
            "r": -52,
            "cost": 1,
            "type": 2
        },
        {
            "q": -70,
            "r": -58,
            "cost": 1,
            "type": 2
        },
        {
            "q": -69,
            "r": -59,
            "cost": 1,
            "type": 2
        },
        {
            "q": -67,
            "r": -57,
            "cost": 1,
            "type": 2
        },
        {
            "q": -75,
            "r": -59,
            "cost": 1,
            "type": 2
        },
        {
            "q": -73,
            "r": -58,
            "cost": 1,
            "type": 2
        },
        {
            "q": -71,
            "r": -56,
            "cost": 1,
            "type": 2
        },
        {
            "q": -70,
            "r": -65,
            "cost": 1,
            "type": 3
        },
        {
            "q": -74,
            "r": -60,
            "cost": 1,
            "type": 2
        },
        {
            "q": -72,
            "r": -58,
            "cost": 1,
            "type": 2
        },
        {
            "q": -69,
            "r": -58,
            "cost": 1,
            "type": 2
        },
        {
            "q": -73,
            "r": -61,
            "cost": 1,
            "type": 2
        },
        {
            "q": -67,
            "r": -58,
            "cost": 1,
            "type": 2
        },
        {
            "q": -66,
            "r": -53,
            "cost": 1,
            "type": 3
        },
        {
            "q": -67,
            "r": -56,
            "cost": 1,
            "type": 2
        },
        {
            "q": -71,
            "r": -60,
            "cost": 1,
            "type": 2
        },
        {
            "q": -72,
            "r": -57,
            "cost": 1,
            "type": 2
        },
        {
            "q": -69,
            "r": -63,
            "cost": 1,
            "type": 3
        },
        {
            "q": -71,
            "r": -55,
            "cost": 1,
            "type": 4
        },
        {
            "q": -69,
            "r": -60,
            "cost": 1,
            "type": 2
        },
        {
            "q": -64,
            "r": -54,
            "cost": 1,
            "type": 3
        },
        {
            "q": -69,
            "r": -53,
            "cost": 1,
            "type": 4
        },
        {
            "q": -71,
            "r": -61,
            "cost": 1,
            "type": 1
        },
        {
            "q": -71,
            "r": -57,
            "cost": 1,
            "type": 2
        },
        {
            "q": -74,
            "r": -59,
            "cost": 1,
            "type": 2
        },
        {
            "q": -69,
            "r": -54,
            "cost": 1,
            "type": 4
        },
        {
            "q": -72,
            "r": -65,
            "cost": 1,
            "type": 2
        },
        {
            "q": -66,
            "r": -55,
            "cost": 1,
            "type": 2
        },
        {
            "q": -74,
            "r": -62,
            "cost": 1,
            "type": 2
        },
        {
            "q": -70,
            "r": -62,
            "cost": 1,
            "type": 2
        },
        {
            "q": -70,
            "r": -60,
            "cost": 1,
            "type": 1
        },
        {
            "q": -68,
            "r": -63,
            "cost": 1,
            "type": 3
        },
        {
            "q": -75,
            "r": -61,
            "cost": 1,
            "type": 2
        },
        {
            "q": -72,
            "r": -62,
            "cost": 1,
            "type": 2
        },
        {
            "q": -67,
            "r": -59,
            "cost": 1,
            "type": 2
        },
        {
            "q": -69,
            "r": -64,
            "cost": 1,
            "type": 3
        },
        {
            "q": -64,
            "r": -55,
            "cost": 1,
            "type": 3
        },
        {
            "q": -70,
            "r": -54,
            "cost": 1,
            "type": 4
        },
        {
            "q": -73,
            "r": -59,
            "cost": 1,
            "type": 2
        },
        {
            "q": -73,
            "r": -57,
            "cost": 1,
            "type": 2
        },
        {
            "q": -67,
            "r": -55,
            "cost": 1,
            "type": 2
        },
        {
            "q": -67,
            "r": -52,
            "cost": 1,
            "type": 2
        },
        {
            "q": -72,
            "r": -61,
            "cost": 1,
            "type": 2
        },
        {
            "q": -71,
            "r": -58,
            "cost": 1,
            "type": 2
        },
        {
            "q": -74,
            "r": -61,
            "cost": 1,
            "type": 2
        },
        {
            "q": -72,
            "r": -64,
            "cost": 1,
            "type": 2
        },
        {
            "q": -68,
            "r": -59,
            "cost": 1,
            "type": 2
        },
        {
            "q": -65,
            "r": -54,
            "cost": 1,
            "type": 3
        },
        {
            "q": -66,
            "r": -54,
            "cost": 1,
            "type": 3
        },
        {
            "q": -70,
            "r": -51,
            "cost": 1,
            "type": 2
        },
        {
            "q": -71,
            "r": -62,
            "cost": 1,
            "type": 2
        },
        {
            "q": -72,
            "r": -56,
            "cost": 1,
            "type": 2
        },
        {
            "q": -69,
            "r": -62,
            "cost": 1,
            "type": 2
        },
        {
            "q": -66,
            "r": -56,
            "cost": 1,
            "type": 2
        },
        {
            "q": -71,
            "r": -63,
            "cost": 1,
            "type": 2
        },
        {
            "q": -68,
            "r": -61,
            "cost": 1,
            "type": 2
        },
        {
            "q": -70,
            "r": -56,
            "cost": 1,
            "type": 2
        },
        {
            "q": -70,
            "r": -59,
            "cost": 1,
            "type": 2
        },
        {
            "q": -68,
            "r": -60,
            "cost": 1,
            "type": 2
        },
        {
            "q": -66,
            "r": -57,
            "cost": 1,
            "type": 2
        },
        {
            "q": -69,
            "r": -55,
            "cost": 1,
            "type": 4
        },
        {
            "q": -73,
            "r": -60,
            "cost": 1,
            "type": 2
        },
        {
            "q": -68,
            "r": -57,
            "cost": 1,
            "type": 2
        },
        {
            "q": -67,
            "r": -62,
            "cost": 1,
            "type": 2
        },
        {
            "q": -68,
            "r": -62,
            "cost": 1,
            "type": 2
        },
        {
            "q": -72,
            "r": -55,
            "cost": 1,
            "type": 4
        },
        {
            "q": -65,
            "r": -55,
            "cost": 1,
            "type": 2
        },
        {
            "q": -67,
            "r": -51,
            "cost": 1,
            "type": 4
        },
        {
            "q": -66,
            "r": -60,
            "cost": 1,
            "type": 2
        },
        {
            "q": -68,
            "r": -58,
            "cost": 1,
            "type": 2
        },
        {
            "q": -69,
            "r": -56,
            "cost": 1,
            "type": 2
        },
        {
            "q": -71,
            "r": -64,
            "cost": 1,
            "type": 2
        },
        {
            "q": -70,
            "r": -61,
            "cost": 1,
            "type": 1
        },
        {
            "q": -66,
            "r": -59,
            "cost": 1,
            "type": 2
        },
        {
            "q": -66,
            "r": -51,
            "cost": 1,
            "type": 2
        },
        {
            "q": -70,
            "r": -53,
            "cost": 1,
            "type": 4
        },
        {
            "q": -66,
            "r": -52,
            "cost": 1,
            "type": 4
        },
        {
            "q": -71,
            "r": -65,
            "cost": 1,
            "type": 2
        },
        {
            "q": -67,
            "r": -53,
            "cost": 1,
            "type": 3
        }
    ],
    "food": [
        {
            "q": -68,
            "r": -52,
            "type": 2,
            "amount": 12
        },
        {
            "q": -65,
            "r": -57,
            "type": 2,
            "amount": 2
        },
        {
            "q": -72,
            "r": -63,
            "type": 1,
            "amount": 3
        },
        {
            "q": -71,
            "r": -54,
            "type": 2,
            "amount": 2
        },
        {
            "q": -69,
            "r": -51,
            "type": 2,
            "amount": 5
        },
        {
            "q": -70,
            "r": -65,
            "type": 1,
            "amount": 3
        },
        {
            "q": -67,
            "r": -58,
            "type": 1,
            "amount": 6
        },
        {
            "q": -69,
            "r": -63,
            "type": 1,
            "amount": 2
        },
        {
            "q": -71,
            "r": -61,
            "type": 3,
            "amount": 3
        },
        {
            "q": -74,
            "r": -59,
            "type": 1,
            "amount": 5
        },
        {
            "q": -69,
            "r": -54,
            "type": 1,
            "amount": 12
        },
        {
            "q": -70,
            "r": -51,
            "type": 2,
            "amount": 3
        }
    ],
    "turnNo": 109,
    "nextTurnIn": 0.634,
    "home": [
        {
            "q": -70,
            "r": -60
        },
        {
            "q": -70,
            "r": -61
        },
        {
            "q": -71,
            "r": -61
        }
    ],
    "score": 220,
    "spot": {
        "q": -70,
        "r": -60
    }
}